{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend files and their roles in the Valentine experience.",
  "frontend/index.css": "Tailwind base layer defining design tokens and color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component rendering the animated background and main Valentine experience.",
  "frontend/src/components/AnimatedDreamyBackground.tsx": "Creates animated gradient background with floating particles.",
  "frontend/src/components/ApologyLetter.tsx": "Displays Akash’s styled apology letter with centered layout and fade‑in animation.",
  "frontend/src/components/CelebrationDecorationsLayer.tsx": "Renders and auto‑cleans floating celebration emoji decorations.",
  "frontend/src/components/RomanticPhotoModal.tsx": "Shows a modal with a couple photo and animated backdrop with close control.",
  "frontend/src/components/TopCenterPopup.tsx": "Auto‑dismissing top‑center toast for No‑button popup messages.",
  "frontend/src/components/ValentineApologyExperience.tsx": "Main flow component managing Yes/No logic, popups, modal, audio, and celebrations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCelebrationSpawner.ts": "Periodically spawns decorative emoji objects with randomized properties and cleans up its interval on unmount.",
  "frontend/src/hooks/useEvasiveNoButton.ts": "Computes and updates random safe positions for a moving 'No' button, adjusting on resize and exposing style and ref.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling auth client setup, login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useNoClickPopups.ts": "Manages a sequence of timed popup messages for No button clicks, ensuring single-popup visibility with auto-dismiss.",
  "frontend/src/hooks/useYesClickAudio.ts": "Initializes and plays an audio file on user gesture, handling autoplay errors silently.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom Valentine-themed variables, animations, and UI effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, fonts, and plugins matching the app's theme.",
  "project_state.json": "Defines project metadata, visual/UX requirements, button behaviors, and architectural notes for building an interactive Valentine-themed apology site. Lists existing features, design rules, and viewport-safe logic for the evasive button and decorative effects."
}